In [1]:
####!pip install pymysql
import pymysql  #### API
import pandas as pd

In [2]:
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='######',db='b76')
print("Connection Established", conn)

C:\Users\HP\AppData\Local\Temp\ipykernel_6884\2690417270.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql_query("SELECT * FROM  movies",conn)

In [6]:
df=pd.read_sql_query("SELECT * FROM  mv1",conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_6884\35115738.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql_query("SELECT * FROM  mv1",conn)

                  title  combined_sales
0          Finding Nemo        936.7433
1   Monsters University        743.5596
2           Ratatoullie        623.7228
3                 Cars2        559.8524
4            Toy Story2        485.0152
5       The Incredibles        631.4421
6                WALL-E        521.3119
7           Toy Story 8       1063.1719
8             Toy Story        361.9587
9                  Cars        461.9831
10                   Up        731.3427
11        Monsters,Inc.        562.8163
12          A Bugs Life        363.3986
13                Brave        538.9832

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Movie_id             14 non-null     int64
 1   Rating               14 non-null     float64
 2   Domestic_sales       14 non-null     int64
 3   International_sales  14 non-null     int64
dtypes: float64(1), int64(3)
memory usage: 580.0 bytes

In [ ]:
!pip install pymysql